ricksorensen/micropython-fun/rjsboards/SEEED_XIAO_ESPSMLFS/mpconfigboard.h
// This configuration is for a generic ESP32C3 board with 4MiB (or more) of flash.

#define MICROPY_HW_BOARD_NAME               "XIAOC3 SML"
#define MICROPY_HW_MCU_NAME                 "ESP32C3"

#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_DAC              (0)
// default I2S for IDF 5 is true 
//#define MICROPY_PY_MACHINE_I2S              (1)  
